# Pandas-1  - Pandas Intro

[Workbook here](https://github.com/elephantscale/machine-learning-learning-path/blob/master/python-data-analysis/pd-1__pandas-intro.md)

Thanks to all the [contributors](#contributors)

### Difficulty Level
★☆☆ - Easy  
★★☆ - Medium  
★★★ - Challenging  
★★★★ - Bonus

## A - Creating dataframes

### A1 - Import Pandas and print out the current version (★☆☆)

In [ ]:
import pandas as pd
pd.__version__

'1.0.5'

### A4 - Create the following dataframe (★☆☆)

In [ ]:
import pandas as pd

cities = pd.DataFrame({
    'city' : ['San Jose', 'San Francisco', 'Los Angeles', 'Seattle' ], 
    'population' : [10, 5, 30, 7], 
    'rainfall' : [15.5, 10.2, 5.5, 50.5]
    
})

cities

            city  population  rainfall
0       San Jose          10      15.5
1  San Francisco           5      10.2
2    Los Angeles          30       5.5
3        Seattle           7      50.5

### A5 - Print the shape of above dataframe (★☆☆)

In [ ]:
cities.shape

(4, 3)

---

## B - Indexing and Slicing

### B1 - In the above dataframe, print out population column (★☆☆)

In [ ]:
cities['population']

0    10
1     5
2    30
3     7
Name: population, dtype: int64

### B2 - Print out column 2

In [ ]:
cities.iloc[:,2]

0    15.5
1    10.2
2     5.5
3    50.5
Name: rainfall, dtype: float64

### B4 - Print out the row for San Francisco (★☆☆)

In [ ]:
cities.iloc[1,:]

city          San Francisco
population                5
rainfall               10.2
Name: 1, dtype: object

### B5 - Print out rainfall number for Settle (★☆☆)

In [ ]:
cities.iloc[3,:]['rainfall']

50.5

---

## C - Manipulating DF

### C1 - Set population for San Francisco to 12 (★☆☆)

In [ ]:
cities.iloc[1,1] = 12
cities

            city  population  rainfall
0       San Jose          10      15.5
1  San Francisco          12      10.2
2    Los Angeles          30       5.5
3        Seattle           7      50.5

### C2 - Add a new row as follows (★☆☆)

city: 'San Diego', population: 8, rainfail: 7.5

In [ ]:
san_diego = pd.DataFrame({'city' : ['San Diego'],
                          'population' : [8],
                          'rainfall' : [7.5]
                          })

cities2 = cities.append(san_diego)
cities2

            city  population  rainfall
0       San Jose          10      15.5
1  San Francisco          12      10.2
2    Los Angeles          30       5.5
3        Seattle           7      50.5
0      San Diego           8       7.5

---

## D - Searching

### D1 - Print rows where population > 10 (★★☆)

In [ ]:
cities.loc[cities['population']>10,]

            city  population  rainfall
1  San Francisco          12      10.2
2    Los Angeles          30       5.5

### D2 - Print rows where population > 10 and rainfal < 10 (★★☆)

In [ ]:
cities.loc [(cities['population']>10) & (cities['rainfall'] < 10) ,]

          city  population  rainfall
2  Los Angeles          30       5.5

---

## E - Reading Files

### E1 - Read the csv files (★☆☆)

In [ ]:
import pandas as pd

house_sales = pd.read_csv('https://elephantscale-public.s3.amazonaws.com/data/house-prices/house-sales-sample.csv')

house_sales

       ID      Date  SalePrice  ...  SqFtLot YrBuilt  ZipCode
0   26353  11/27/12     716831  ...     5326    2012       -1
1   22594   1/30/07     439900  ...     9988    1992    98031
2   10916    3/9/10     415000  ...     6180    1908    98118
3   11555   6/25/08    1050000  ...    19354    1978    98006
4   19360   9/24/08     777990  ...     5958    2008    98053
..    ...       ...        ...  ...      ...     ...      ...
95  13456   7/25/12     359000  ...    20964    1981    98042
96  22585   10/9/08     465000  ...     7245    1987    98074
97  17869   2/22/08     327000  ...     8820    1947    98125
98   2992   10/3/06     344950  ...     1097    2002    98133
99   8945   9/13/06     384950  ...     1255    2006       -1

[100 rows x 11 columns]

### E2 - And how many sales for 'Bedrooms = 4' (★☆☆)

In [ ]:
house_sales.groupby('Bedrooms').size()

Bedrooms
2    18
3    44
4    32
5     6
dtype: int64

---

<a name="contributors"/>

## Contributors
Following people made this possible!  
Thank you!!

- Sujee Maniyam @ ElephantScale   (<sujee@elephantscale.com>)